//
//  DictionaryConstants.swift
//  ECNU-Timetable-ics
//
//  Created by JJAYCHEN on 2020/3/11.
//

// MARK: Time Dictionary Constants

let 开学日期 = [
    "2019": [
        "1": "2019.09.01",
        "2": "2020.03.09",
        "3": "2020.07.06",
    ],
    "2020": [
        "1": "",
        "2": "",
        "3": "",
    ]
]

let 星期转数字 = [
    "星期一": 0,
    "星期二": 1,
    "星期三": 2,
    "星期四": 3,
    "星期五": 4,
    "星期六": 5,
    "星期日": 6,
]

let 开始上课时间 = [
    "1": 8,
    "2": 8,
    "3": 10,
    "4": 10,
    "5": 13,
    "6": 13,
    "7": 15,
    "8": 15,
    "9": 18,
    "10": 18,
    "11": 20,
]

let 结束上课时间 = [
    "1": 8,
    "2": 9,
    "3": 10,
    "4": 11,
    "5": 13,
    "6": 14,
    "7": 15,
    "8": 16,
    "9": 18,
    "10": 19,
    "11": 20,
]

let 索引转学期 = [
    "1": "第一学期",
    "2": "第二学期",
    "3": "暑学期"
]

